//
// Created by danil on 02.05.2022.
//

#ifndef KURSAH_STRINGS_H
#define KURSAH_STRINGS_H

#include <string>

using std::string;

string firstName1[] = {
        "Александр", "Алексей", "Андрей", "Вадим", "Борис", "Виталий", "Владислав", "Виктор", "Владимир", "Георгий",
        "Глеб", "Григорий", "Данила", "Денис", "Дмитрий", "Евгений", "Егор", "Ефим", "Иван", "Игорь", "Илья", "Кирилл",
        "Константин", "Леонид", "Максим", "Михаил", "Никита", "Николай", "Олег", "Павел", "Роман", "Сергей", "Тимофей"
};

string firstName2[] = {
        "Агата", "Александра", "Алиса", "Алина", "Анастасия", "Арина", "Валентина", "Влада", "Вероника",
        "Галина", "Гера", "Дарья", "Диана", "Ева", "Елена", "Евгения", "Елизавета", "Екатерина", "Зоя",
        "Инесса", "Инга", "Кира", "Ксения", "Карина", "Кристина", "Людмила", "Лариса", "Лидия", "Любовь",
        "Мария", "Марина", "Надежда", "Наталья", "Оксана", "Олеся", "Пелагея", "Полина", "Светлана", "София",
        "Татьяна", "Ульяна"
};

string secondName1[] = {
        "Дмитриев",  "Королев",  "Гусев",  "Киселев",  "Ильин",  "Максимов",  "Поляков",  "Сорокин",  "Виноградов",
        "Ковалев", "Белов",  "Медведев",  "Антонов",  "Тарасов",  "Жуков",  "Баранов",  "Филиппов",  "Комаров",
        "Давыдов",  "Беляев",  "Герасимов",  "Богданов",  "Осипов",  "Сидоров",  "Матвеев",  "Титов",  "Марков",
        "Миронов",  "Крылов",  "Куликов",  "Карпов",  "Власов",  "Мельников",  "Денисов",  "Гаврилов",  "Тихонов",
        "Казаков", "Савельев", "Фомин",  "Чернов",  "Абрамов",  "Мартынов",
        "Ефимов",  "Федотов",  "Щербаков",  "Назаров",  "Калинин","Исаев",  "Чернышев",  "Быков",  "Маслов",
        "Родионов",  "Коновалов",  "Лазарев",  "Воронин",  "Климов",  "Филатов", "Пономарев",  "Голубев",  "Кудрявцев",
        "Прохоров",  "Наумов",  "Потапов",  "Журавлев",  "Овчинников", "Трофимов",  "Леонов",  "Соболев",  "Ермаков",
        "Колесников",  "Гончаров",  "Емельянов",  "Никифоров", "Грачев",  "Котов",  "Гришин",  "Ефремов",  "Архипов",
        "Громов",  "Малышев"
};

string secondName2[] = {
        "Дмитриевна",  "Гусева",  "Киселева",  "Ильина",  "Максимова",  "Полякова",  "Сорокина",  "Виноградова",
        "Ковалева",  "Белова",  "Медведева",  "Антонова",  "Тарасова",  "Жукова",  "Баранова",  "Филиппова",
        "Комарова",  "Давыдовна",  "Беляева",  "Герасимова",  "Богданова",  "Осипова",  "Сидорова",  "Матвеева",
        "Титова",  "Маркова",  "Миронова", "Крылова",  "Куликова",  "Карпова",  "Власова",  "Мельникова",  "Денисова",
        "Гаврилова",  "Тихонова",  "Казакова", "Савельева", "Фомина",
        "Чернова",  "Абрамова",  "Мартынова",  "Ефимова",  "Федотова",  "Щербакова",  "Назарова",  "Калинина",
        "Исаева",  "Чернышева",  "Быкова",  "Маслова",  "Родионова",  "Коновалова",  "Лазарева",  "Воронина",
        "Климова",  "Филатова",  "Пономарева",  "Голубева",  "Кудрявцева",  "Прохорова",  "Наумова",  "Потапова",
        "Журавлева",  "Овчинникова",  "Трофимова",  "Леонова",  "Соболева",  "Ермакова",  "Колесникова",  "Гончарова",
        "Емельянова",  "Никифорова",  "Грачева",  "Котова",  "Гришина",  "Ефремова",  "Архипова",  "Громова",
        "Малышева"
};

string thirdName1[] = {
        "Абрамович", "Андреевич", "Артемьевич", "Богданович" , "Борисович", "Вадимович", "Валериевич", "Васильевич", "Викторович"
        , "Виталиевич", "Владимирович", "Георгиевич", "Глебович", "Данилович", "Денисович", "Дмитриевич", "Евгениевич",
        "Егорович", "Игоревич", "Ильич", "Константинович", "Леонидович", "Максимович", "Матвеевич", "Никитич"
        , "Николаевич", "Олегович", "Павлович", "Петрович", "Семёнович", "Ярославович"
};

string thirdName2[] = {
        "Абрамовна", "Андреевна", "Артемьевна", "Богдановна" , "Борисовна", "Вадимовна", "Валериевна", "Васильевна", "Викторовна"
        , "Виталиевна", "Владимировна", "Георгиевна", "Глебовна", "Даниловна", "Денисовна", "Дмитриевна", "Евгениевна",
        "Егоровна", "Игоревна", "Ильинична", "Константиновна", "Леонидовна", "Максимовна", "Матвеевна", "Никитична"
        , "Николаевна", "Олеговна", "Павловна", "Петровна", "Семёновна", "Ярославовна"
};

#endif //KURSAH_STRINGS_H
